# Pandas3 - Data Preprocessing and Calculation

In [1]:
import pandas as pd

## (1) Oil price

**(1.1) Given the following dataframe, calcualte the number of missing values in each column.**

In [2]:
month = ['Jan','Feb','Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec']
price = [63.9,None,66,71.5,70.9,61.9,None,59.4,None,58.5,63.3,64.5]
oil_df = pd.DataFrame({"month":month,"price":price})
oil_df

   month  price
0    Jan   63.9
1    Feb    NaN
2    Mar   66.0
3    Apr   71.5
4    May   70.9
5    Jun   61.9
6    Jul    NaN
7    Aug   59.4
8    Sep    NaN
9    Oct   58.5
10   Nov   63.3
11   Dec   64.5

In [3]:
oil_df.isnull().sum()

month    0
price    3
dtype: int64

**(1.2) Use the dataframe in (1.1). Fill in missing values with the price of the previous month.**

In [4]:
oil_df.fillna(method = 'ffill')

   month  price
0    Jan   63.9
1    Feb   63.9
2    Mar   66.0
3    Apr   71.5
4    May   70.9
5    Jun   61.9
6    Jul   61.9
7    Aug   59.4
8    Sep   59.4
9    Oct   58.5
10   Nov   63.3
11   Dec   64.5

**(1.3) Use the dataframe in (1.1). Fill in missing values with the average price. Round numbers to one decimal place.**

In [5]:
oil_df.fillna(round(oil_df.price.mean(),1))

   month  price
0    Jan   63.9
1    Feb   64.4
2    Mar   66.0
3    Apr   71.5
4    May   70.9
5    Jun   61.9
6    Jul   64.4
7    Aug   59.4
8    Sep   64.4
9    Oct   58.5
10   Nov   63.3
11   Dec   64.5

## (2) Melbourne housing data

**(2.1) Import the dataset <code>melbourne.csv</code>. Show the first five rows.**

In [6]:
melbourne_df = pd.read_csv("../dataset/melbourne.csv")
melbourne_df.head(5)

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0

**(2.2) Select the data for the following suburbs. Store the result as a new dataframe and use it to answer the remaining questions. Show the first five rows.** <br>
<code>Reservoir, Richmond, Brunswick, Bentleigh East, Coburg, Preston</code>

In [7]:
melbourne_sub = melbourne_df[melbourne_df.Suburb.isin(['Reservoir', 'Richmond', 'Brunswick', 'Bentleigh East', 'Coburg', 'Preston'])]
melbourne_sub.head(5)

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
787,Bentleigh East,18 Mervin St,2,h,1410000.0,S,hockingstuart,3/09/2016,13.9,3165.0,...,1.0,2.0,768.0,NaN,NaN,Glen Eira,-37.9305,145.0547,Southern Metropolitan,10969.0
788,Bentleigh East,1/69 Purtell St,3,t,760000.0,PI,hockingstuart,3/09/2016,13.9,3165.0,...,1.0,2.0,287.0,NaN,NaN,Glen Eira,-37.9261,145.0566,Southern Metropolitan,10969.0
789,Bentleigh East,30 Veronica St,2,h,825000.0,S,Buxton,3/09/2016,13.9,3165.0,...,2.0,1.0,176.0,125.0,2008.0,Glen Eira,-37.9237,145.0763,Southern Metropolitan,10969.0
790,Bentleigh East,2a Bessie St,2,u,746000.0,S,hockingstuart,3/12/2016,13.9,3165.0,...,1.0,2.0,281.0,95.0,2002.0,Glen Eira,-37.9255,145.0796,Southern Metropolitan,10969.0
791,Bentleigh East,14a Daphne St,1,u,580000.0,S,Woodards,3/12/2016,13.9,3165.0,...,1.0,1.0,105.0,NaN,NaN,Glen Eira,-37.9181,145.0586,Southern Metropolitan,10969.0

**(2.3) Calculate the average price in each suburb. Display the top three suburbs with the highest average price and round the result to one decimal place.**<br>

In [8]:
# [solution-1] Use groupby

# step1: Get groupby object
gb_suburb = melbourne_sub.groupby("Suburb")

# step2: Calculate the average price for each suburb
avg_price = gb_suburb.Price.mean()

# step3: Sort the series
avg_price.sort_values(ascending = False).head(3).round(1)

# Write step1-3 in one line
#melbourne_sub.groupby("Suburb").Price.mean().sort_values(ascending = False).head(3).round(1)

Suburb
Bentleigh East    1085591.9
Richmond          1083564.4
Brunswick         1013171.2
Name: Price, dtype: float64

In [9]:
# [solution-2] Use pivot_table
melbourne_sub.pivot_table(index = "Suburb", values = "Price", aggfunc = "mean").sort_values(by = "Price",ascending = False).head(3).round(1)

                    Price
Suburb
Bentleigh East  1085591.9
Richmond        1083564.4
Brunswick       1013171.2

**(2.4) What is the largest </code>land size</code> in each suburb?**<br>
Hint: Column "Landsize"

In [10]:
melbourne_sub.groupby("Suburb").Landsize.max()

Suburb
Bentleigh East     1080.0
Brunswick          4676.0
Coburg             3747.0
Preston            3037.0
Reservoir         41400.0
Richmond          14294.0
Name: Landsize, dtype: float64

**(2.5) What is the highest price in each region?**<br>
Hint: Column "Regionname"

In [11]:
melbourne_sub.groupby("Regionname").Price.max()

Regionname
Northern Metropolitan    3335000.0
Southern Metropolitan    1962000.0
Name: Price, dtype: float64

## (3) US National Parks and their animal and plant species

The dataset "species.csv" provides information on the presence and status of species in US national parks. Each park species record includes a species ID, park name, taxonomic information, scientific name, one or more common names, record status, occurrence (verification of species presence in park), nativeness (species native or foreign to park), abundance (presence and visibility of species in park), seasonality (season and nature of presence in park), and conservation status (species classification according to US Fish & Wildlife Service). Taxonomic classes have been translated from Latin to English for species categorization; order, family, and scientific name (genus, species, subspecies) are in Latin.

**(3.1) Import the dataset <code>species.csv</code>. Show the summary of this dataset including column names and their data types.** (You will get a warning message about the data type. You can ignore this message, it will not affect the following exercises.)

In [12]:
species_raw_df = pd.read_csv("../dataset/species.csv")
species_raw_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119248 entries, 0 to 119247
Data columns (total 14 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   Species ID           119248 non-null  object
 1   Park Name            119248 non-null  object
 2   Category             119248 non-null  object
 3   Order                117776 non-null  object
 4   Family               117736 non-null  object
 5   Scientific Name      119248 non-null  object
 6   Common Names         119248 non-null  object
 7   Record Status        119248 non-null  object
 8   Occurrence           99106 non-null   object
 9   Nativeness           94203 non-null   object
 10  Abundance            76306 non-null   object
 11  Seasonality          20157 non-null   object
 12  Conservation Status  4718 non-null    object
 13  Unnamed: 13          5 non-null       object
dtypes: object(14)
memory usage: 12.7+ MB

/var/folders/hx/z23rbxyx5xv63zy53xdl10qw0000gp/T/ipykernel_65265/2837194896.py:1: DtypeWarning: Columns (13) have mixed types. Specify dtype option on import or set low_memory=False.
  species_raw_df = pd.read_csv("../dataset/species.csv")

**(3.2) Select all species belonging to "Canidae" family. Store the data as a new dataframe called <code>species_df</code> with the following columns: <code>'Species ID', 'Park Name', 'Common Names', 'Family', 'Abundance'</code>. Use this dataframe to answer questions 3.3 to 3.5.**

In [13]:
# [solution-1] 

# step1: Select the species belonging to "Canidae" family 
df_temp = species_raw_df[species_raw_df["Family"]=="Canidae"]

# step2: Select columns
species_df = df_temp.loc[:,['Species ID', 'Park Name', 'Common Names', 'Family', 'Abundance']]

species_df.head(5)

,Species ID,Park Name,Common Names,Family,Abundance
2,ACAD-1002,Acadia National Park,"Coyote, Eastern Coyote",Canidae,Common
3,ACAD-1003,Acadia National Park,"Eastern Timber Wolf, Gray Wolf, Timber Wolf",Canidae,NaN
4,ACAD-1004,Acadia National Park,"Black Fox, Cross Fox, Eastern Red Fox, Fox, Re...",Canidae,Common
1713,ARCH-1004,Arches National Park,Coyote,Canidae,Uncommon
1714,ARCH-1005,Arches National Park,Common Gray Fox,Canidae,Uncommon

In [14]:
# [solution-2] step1+step2
species_df = species_raw_df.loc[species_raw_df["Family"]=="Canidae",['Species ID','Park Name', 'Common Names', 'Family', 'Abundance']]
species_df.head(5)

,Species ID,Park Name,Common Names,Family,Abundance
2,ACAD-1002,Acadia National Park,"Coyote, Eastern Coyote",Canidae,Common
3,ACAD-1003,Acadia National Park,"Eastern Timber Wolf, Gray Wolf, Timber Wolf",Canidae,NaN
4,ACAD-1004,Acadia National Park,"Black Fox, Cross Fox, Eastern Red Fox, Fox, Re...",Canidae,Common
1713,ARCH-1004,Arches National Park,Coyote,Canidae,Uncommon
1714,ARCH-1005,Arches National Park,Common Gray Fox,Canidae,Uncommon

**(3.3) Replace missing values with "Unknown".** (Apply this change directly to the dataframe.)

In [15]:
species_df.fillna("Unknown", inplace = True)

**(3.4) Shows the number of species in each <code>Abundance</code> category.**<br>
Example:<br>
Uncommon:   95<br>
Common:     42<br>
...<br>
...

In [16]:
# [solution-1] Calculate the frequency of each unique value (sort in descending order)
species_df.Abundance.value_counts()

Unknown       95
Common        42
Uncommon      37
Rare          15
Occasional     7
Abundant       4
Name: Abundance, dtype: int64

In [17]:
# [solution-2] Group the data by the categorical column and count the number of rows (species) in each group 
species_df.groupby("Abundance").size()

Abundance
Abundant       4
Common        42
Occasional     7
Rare          15
Uncommon      37
Unknown       95
dtype: int64

**(3.5) Calculate the number of species in each park and show the top five parks with the largest number of species.**<br>
Hint: column <code>Park Name</code>.

In [18]:
# [solution-1]
species_df.value_counts("Park Name").head()

Park Name
Death Valley National Park             9
Great Basin National Park              7
Great Smoky Mountains National Park    7
Mesa Verde National Park               5
Petrified Forest National Park         5
dtype: int64

In [19]:
# [solution-2]
species_df.groupby("Park Name").size().sort_values(ascending = False).head()

Park Name
Death Valley National Park             9
Great Basin National Park              7
Great Smoky Mountains National Park    7
Mesa Verde National Park               5
Petrified Forest National Park         5
dtype: int64

## (4) Customer profile analysis
A mall has gathered data on their customers through a loyalty program. They have information about age, gender, annual income and spending score. Spending Score is a measure from 0 to 100, created for each customer based on customer behavior and purchasing data.

**(4.1) Import dataset <code>customers.csv</code> and use the column <code>CustomerID</code> as the index. Display the first five rows.**<br>
Hint: pd.read_csv("filename", index_col = "CustomerID")

In [20]:
customer_df = pd.read_csv("../dataset/customers.csv", index_col = "CustomerID")
customer_df.head(5)

            Gender  Age  Annual Income (k$)  Spending Score (1-100)
CustomerID
1             Male   19                  15                      39
2             Male   21                  15                      81
3           Female   20                  16                       6
4           Female   23                  16                      77
5           Female   31                  17                      40

**(4.2) Rename the columns according to the table below.**<br>
Hint: df.columns = ['gender', 'age', 'income', 'spending_score']

|column name| new column name|
|:-:|:-:|
|Gender|gender|
|Age|age|
|Annual Income (k$)|income|
|Spending Score (1-100)|spending_score|

In [21]:
customer_df.columns = ['gender', 'age', 'income', 'spending_score']
customer_df.head(5)

            gender  age  income  spending_score
CustomerID
1             Male   19      15              39
2             Male   21      15              81
3           Female   20      16               6
4           Female   23      16              77
5           Female   31      17              40

**(4.3) Calculate the average age for each gender group. Round the numbers to whole numbers.**<br>

In [22]:
customer_df.groupby("gender").age.mean().round()

gender
Female    38.0
Male      40.0
Name: age, dtype: float64

**(4.4) Convert the column <code>age</code> to age group according to the table below. Store the result in a new column named <code>age_group</code>.**<br>
Hint: pd.cut()

|range| label|
|:-:|:-:|
|18-35| young adults|
|36-55| middle-aged adults|
|56-75| older adults |

In [23]:
customer_df["age_group"] = pd.cut(customer_df.age, 
                                  bins = [18,35,55,75],
                                  labels = ["young adults","middle-aged adults","older adults"], 
                                  include_lowest = True)
customer_df.head(5)

            gender  age  income  spending_score     age_group
CustomerID
1             Male   19      15              39  young adults
2             Male   21      15              81  young adults
3           Female   20      16               6  young adults
4           Female   23      16              77  young adults
5           Female   31      17              40  young adults

**(4.5) Calculate the average income for each age group. Round the numbers to two decimal places.**<br>

In [24]:
customer_df.groupby("age_group").income.mean().round(2)

age_group
young adults          59.44
middle-aged adults    64.79
older adults          53.69
Name: income, dtype: float64

**(4.6) Group the data by columns <code>age_group</code> and <code>gender</code>. Calculate the average spending score for each group. Round the numbers to two decimal places.**

In [25]:
# [solution-1] 
customer_df.groupby(["age_group", "gender"]).spending_score.mean().round(2)

age_group           gender
young adults        Female    62.54
                    Male      58.29
middle-aged adults  Female    40.07
                    Male      41.69
older adults        Female    40.27
                    Male      37.22
Name: spending_score, dtype: float64

In [26]:
# [solution-2]
customer_df.pivot_table(index = "age_group", 
                        columns = "gender", 
                        values = "spending_score", 
                        aggfunc = "mean").round(2)

gender              Female   Male
age_group
young adults         62.54  58.29
middle-aged adults   40.07  41.69
older adults         40.27  37.22

In [27]:
# [solution-3]
pd.crosstab(index = customer_df.age_group, 
             columns = customer_df.gender, 
             values = customer_df.spending_score, 
             aggfunc = "mean").round(2)

gender              Female   Male
age_group
young adults         62.54  58.29
middle-aged adults   40.07  41.69
older adults         40.27  37.22